#+title: Do E Block Def

#+begin_src R
options(crayon.enabled=FALSE)
library(DoE.base)
library(tidyverse)

fator_size = c(8192, 14400,16000, 32000)
fator_blocksize = c(300, 320, 360, 400, 420)
fator_scheduler = c("dmda", "lws", "dmdas", "random")
fator_pq = c("1x6", "6x1", "3x2", "2x3")

fac.design(nfactors=4,
           replications=10,
           repeat.only= FALSE ,
           randomize=TRUE,
           seed=0,
           nlevels=c(length(fator_size),
                     length(fator_blocksize),
                     length(fator_scheduler),
                     length(fator_pq)),
           factor.names=list(
             size = fator_size,
             block_size = fator_blocksize,
             scheduler = fator_scheduler,
             pq = fator_pq
           )) |>
  as_tibble() |>
  filter(size == 14400) |>
  filter(scheduler == "lws") |>
  filter(pq == "1x6") |>
  mutate(exp = "block-def") |>
  mutate(Order = paste0(exp, "_", block_size, "_", 1:n())) |>
  select(-Blocks) |>
  write_csv("block-def_experimental_project.csv", progress=FALSE) |>
  print()
#+end_src

#+RESULTS:
| 14400 | 300 | lws | 1x6 | block-def | block-def_300_1  |
| 14400 | 400 | lws | 1x6 | block-def | block-def_400_2  |
| 14400 | 320 | lws | 1x6 | block-def | block-def_320_3  |
| 14400 | 360 | lws | 1x6 | block-def | block-def_360_4  |
| 14400 | 420 | lws | 1x6 | block-def | block-def_420_5  |
| 14400 | 400 | lws | 1x6 | block-def | block-def_400_6  |
| 14400 | 360 | lws | 1x6 | block-def | block-def_360_7  |
| 14400 | 320 | lws | 1x6 | block-def | block-def_320_8  |
| 14400 | 300 | lws | 1x6 | block-def | block-def_300_9  |
| 14400 | 420 | lws | 1x6 | block-def | block-def_420_10 |
| 14400 | 400 | lws | 1x6 | block-def | block-def_400_11 |
| 14400 | 300 | lws | 1x6 | block-def | block-def_300_12 |
| 14400 | 420 | lws | 1x6 | block-def | block-def_420_13 |
| 14400 | 360 | lws | 1x6 | block-def | block-def_360_14 |
| 14400 | 320 | lws | 1x6 | block-def | block-def_320_15 |
| 14400 | 420 | lws | 1x6 | block-def | block-def_420_16 |
| 14400 | 320 | lws | 1x6 | block-def | block-def_320_17 |
| 14400 | 300 | lws | 1x6 | block-def | block-def_300_18 |
| 14400 | 360 | lws | 1x6 | block-def | block-def_360_19 |
| 14400 | 400 | lws | 1x6 | block-def | block-def_400_20 |
| 14400 | 300 | lws | 1x6 | block-def | block-def_300_21 |
| 14400 | 400 | lws | 1x6 | block-def | block-def_400_22 |
| 14400 | 320 | lws | 1x6 | block-def | block-def_320_23 |
| 14400 | 420 | lws | 1x6 | block-def | block-def_420_24 |
| 14400 | 360 | lws | 1x6 | block-def | block-def_360_25 |
| 14400 | 400 | lws | 1x6 | block-def | block-def_400_26 |
| 14400 | 360 | lws | 1x6 | block-def | block-def_360_27 |
| 14400 | 420 | lws | 1x6 | block-def | block-def_420_28 |
| 14400 | 320 | lws | 1x6 | block-def | block-def_320_29 |
| 14400 | 300 | lws | 1x6 | block-def | block-def_300_30 |
| 14400 | 360 | lws | 1x6 | block-def | block-def_360_31 |
| 14400 | 420 | lws | 1x6 | block-def | block-def_420_32 |
| 14400 | 300 | lws | 1x6 | block-def | block-def_300_33 |
| 14400 | 400 | lws | 1x6 | block-def | block-def_400_34 |
| 14400 | 320 | lws | 1x6 | block-def | block-def_320_35 |
| 14400 | 320 | lws | 1x6 | block-def | block-def_320_36 |
| 14400 | 400 | lws | 1x6 | block-def | block-def_400_37 |
| 14400 | 360 | lws | 1x6 | block-def | block-def_360_38 |
| 14400 | 300 | lws | 1x6 | block-def | block-def_300_39 |
| 14400 | 420 | lws | 1x6 | block-def | block-def_420_40 |
| 14400 | 300 | lws | 1x6 | block-def | block-def_300_41 |
| 14400 | 420 | lws | 1x6 | block-def | block-def_420_42 |
| 14400 | 360 | lws | 1x6 | block-def | block-def_360_43 |
| 14400 | 320 | lws | 1x6 | block-def | block-def_320_44 |
| 14400 | 400 | lws | 1x6 | block-def | block-def_400_45 |
| 14400 | 360 | lws | 1x6 | block-def | block-def_360_46 |
| 14400 | 320 | lws | 1x6 | block-def | block-def_320_47 |
| 14400 | 300 | lws | 1x6 | block-def | block-def_300_48 |
| 14400 | 420 | lws | 1x6 | block-def | block-def_420_49 |
| 14400 | 400 | lws | 1x6 | block-def | block-def_400_50 |
